31-rails-as-an-api/pokemon-backend/app/controllers/trainers_controller.rb

SELECT "trainers".* FROM "trainers"
---
  def index
    render :json => Trainer.all